Repository: nikitaGlobal/ng-wpmail2telegram
Catalog: languages/ng-mail2telegram-*.po
Languages: ru_ru

source: NG WP Mail to telegram
ru_ru: NG Отправка писем в Телеграм

source: Bot token
ru_ru: Ключ бота

source: init webhooks for this site
ru_ru: обрабатывать веб-зацепы на этом сайте

source: Message filter
ru_ru: Фильтр сообщений

source: Do not filter
ru_ru: Не фильтровать

source: Send subject only
ru_ru: Отправлять только заголовок

source: Send as html
ru_ru: Отправлять в формате HTML

source: Cut long message
ru_ru: Обрезать длинные сообщения

source: Strip html tags
ru_ru: Убирать теги

source: Send file
ru_ru: Отправлять файл

source: Broken link
ru_ru: Недействительная ссылка

source: Settings
ru_ru: Настройки

source: Testing bot
ru_ru: Проверяем бота

source: Bot settings
ru_ru: Настройки бота

source: Subscribed
ru_ru: Вы подписаны

source: Please log in first
ru_ru: Пожалуйста, авторизуйтесь

source: Unknown command
ru_ru: Неизвестная команда

source: Hello. Please follow this link to subscribe:
ru_ru: Здравствуйте. Пожалуйста, перейдите по ссылке чтобы подписаться:

source: Create your own notification bot which will send emails to your dashboard users via telegram.
ru_ru: Создайте бота, который будет отправлять админам сайта уведомления в Телеграме

source: Sends all mails to telegram user via your own bot. No need in many other plugins as you can use any email notifications which will be redirected to telegram
ru_ru: Отправляет все письма пользователям Телеграма через вашего бота. Заменяет множество других плагинов т.к. вы можете использовать любые почтовые уведомления и они будут перенаправляться в Телеграм.

source: Each user which has access to wp-admin should start chat with your bot and follow the subscription link
ru_ru: Каждому пользователю, у которого есть доступ в админку, надо добавить бота, потом перейти по ссылке для подписки.

source: This plugin makes HTTP-requests to 3rd party service <a href="https://core.telegram.org/api">Telegram API</a> to send notifications.
ru_ru: Плагин отправляет http-запросы на внешний сервис <a href="https://core.telegram.org/api">Telegram API</a> для рассылки уведомлений

source: ** Message Filters ** Currently can send mails as plaintext, files, subjects only and truncated message. You can extend this range using the filters - see source code.
ru_ru: ** Фильтры сообщений ** В настоящий момент сообщения могут содержать текст письма, файл с письмом, заголовок, либо обрезанное сообщение.

source: Your website should support https.
ru_ru: Для работы плагина на вашем сайте должна быть поддержка https

source: Use WordPress' Add New Plugin feature, searching "NG-mail2Telegram, or download the archive and:
ru_ru: С помощью кнопки WordPress "Добавить плагин", найдите "NG-mail2telegram" или скачайте архив, затем:

source: Fill in plugin settings with your bot token
ru_ru: Добавьте в настройки bot token

source: Register your own bot as described <a href="here">https://core.telegram.org/bots#6-botfather</a>
ru_ru: Создайте бота по инструкции <a href="here">https://core.telegram.org/bots#6-botfather</a>

source: Activate the plugin through the 'Plugins' menu in WordPress
ru_ru: Активируйте плагин в меню "Плагины"

source: Upload plugin directory to the <code>/wp-content/plugins/</code> directory
ru_ru: Активируйте плагин в меню "Плагины"

source: Unzip the archive on your computer
ru_ru: Распакуйте архив на компьютере.

source: Better multilanguage support
ru_ru: Улучшена поддержка языков

source: The First Upload, but was tested before at several sites
ru_ru: Первая загрузка. Но плагин был испытан на нескольких сайтах
